Revit 2027 API
BuiltInFailures.SiteImportFailures.NoViewSpecificSiteImports Property
 Can't make Toposurface from View Specific Imports.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoViewSpecificSiteImports { get; }
Public Shared ReadOnly Property NoViewSpecificSiteImports As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoViewSpecificSiteImports {
	FailureDefinitionId^ get ();
}
static member NoViewSpecificSiteImports : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace